# normal 1
import math
list1 = [2, -5, 8, 9, -25, 25, 4]
list2 = []
for i in list1:
    if (i>0 and math.sqrt(i)%1 == 0):
        list2.append(int(math.sqrt(i)))
print(list2)

# normal 2
data = "02.11.2013"
data_list = data.split(".")
days = {"01": "первое", "02": "второе", "03": "третье", "04": "четвертое", "05": "пятое",
        "06": "шестое", "07": "седьмое", "08": "восьмое", "09": "девятое", "10": "десятое",
        "11": "одиннадцатое", "12": "двенадцатое", "13": "тринадцатое", "14": "четырнадцатое", "15": "пятнадцатое",
        "16": "шестнадцатое", "17": "семнадцатое", "18": "восемнадцатое", "19": "девятнадцатое", "20": "двадцатое",
        "21": "двадцать первое", "22": "двадцать второе", "23": "двадцать третье", "24": "двадцать четвертое",
        "25": "двадцать пятое", "26": "двадцать шестое", "27": "двадцать седьмое", "28": "двадцать восьмое",
        "29": "двадцать девятое", "30": "тридцатое", "31": "тридцать первое"}

months = {"01": "января", "02": "февраля", "03": "марта", "04": "апреля", "05": "мая", "06": "июня",
          "07": "июля", "08": "августа", "09": "сентября", "10": "октября", "11": "ноября", "12": "декабря"}
for day in days:
    if data_list[0] == day:
        data_list[0] = days[day]
        break
for month in months:
    if data_list[1] == month:
        data_list[1] = months[month]
        break
print("{} {} {} года".format(data_list[0], data_list[1], data_list[2]))
# Выводит 02 ноября 2013 года!!! Не понимаю почему, т.к. с месяцами отрабатывает все замечательно.

# normal 3
import random
n = int(input("Введите количество элементов списка:"))
list = []
for i in range(n):
    list.append(random.randint(-100, 100))
print(list)

# normal 4
list = [1, 2, 4, 5, 6, 2, 5, 2]
list1 = set(list)
print(list1)
list2 = []
for i in list:
    if list.count(i) == 1:
        list2.append(i)
print(list2)